<script setup lang="ts">
import { Button, Dialog } from 'primevue';
import { backArrow } from '@/assets/icons';
import VIcon from '@/components/UI/VIcon.vue';

defineProps<{
  modelValue: boolean
}>();

const emits = defineEmits<{
  (e: 'close'): void
}>();

const model = defineModel<boolean>('modelValue');

const textJson = [
  {
    title: 'Общие положения',
    text: [
      'Настоящая Политика конфиденциальности определяет порядок обработки и защиты персональных данных участников Программы лояльности Oblacko — «Бонусы от братьев».',
      'Организатор обязуется обеспечивать защиту персональных данных в соответствии с Законом Республики Узбекистан «О персональных данных» от 2 июля 2019 года № ЗРУ-547.',
    ],
  },
  {
    title: 'Персональные данные',
    text: [
      'Организатор собирает и обрабатывает следующие данные Участников:',
    ],
    list: [
      'имя (никнейм Telegram),',
      'номер телефона,',
      'Telegram ID (аккаунт),',
      'история начисленных и использованных бонусов.',
    ],
  },

  {
    title: 'Цели обработки',
    text: [
      'Персональные данные используются исключительно для:',
    ],
    list: [
      'регистрации в Программе,',
      'начисления и списания бонусов,',
      'информирования о состоянии бонусного счёта и условиях Программы.',
    ],
  },

  {
    title: 'Передача данных третьим лицам',
    text: [
      'Персональные данные не передаются третьим лицам, за исключением случаев, прямо предусмотренных законодательством Республики Узбекистан.',
    ],
  },

  {
    title: 'Хранение и защита данных',
    text: [
      'Организатор принимает все необходимые организационные и технические меры для защиты персональных данных от неправомерного доступа, изменения или уничтожения.',
      'Данные хранятся до момента отзыва согласия Участником либо до завершения Программы.',
    ],
  },

  {
    title: 'Права участника',
    text: [
      'Участник вправе:',
    ],
    list: [
      'запросить информацию о своих персональных данных,',
      'требовать их изменения или удаления,',
      'отозвать согласие на обработку данных путём обращения к Организатору через Telegram-бот.',
    ],
  },

  {
    title: 'Заключительные положения',
    text: [
      'Настоящая Политика конфиденциальности является неотъемлемой частью Публичной оферты.',
      'Организатор вправе вносить изменения в Политику, уведомив об этом Участников через Telegram-бот.',
    ],
  },
];
</script>

<template>
  <Dialog
    v-model:visible="model"
    modal
    class="full-dialog"
    @hide="emits('close')"
  >
    <template #header>
      <div class="header">
        <div class="font-16-r">
          📄 ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ
        </div>
        <div class="font-14-l color-secondary">
          программы лояльности «Бонусы от братьев»
        </div>
      </div>
    </template>
    <template #closebutton>
      <Button text severity="secondary" size="small" style="padding: .7rem" @click="model = false">
        <VIcon :icon="backArrow" color="white" />
      </Button>
    </template>
    <div class="content">
      <template v-for="(item, itemIndex) in textJson" :key="itemIndex">
        <h3 class="font-16-l">
          {{ itemIndex + 1 }}. {{ item.title }}
        </h3>
        <p v-for="(paragraph, paragraphIndex) in item.text" :key="paragraphIndex">
          {{ itemIndex + 1 }}.{{ paragraphIndex + 1 }} {{ paragraph }}
        </p>
        <ul v-if="item.list">
          <li v-for="listElement in item.list" :key="listElement">
            {{ listElement }}
          </li>
        </ul>
      </template>
    </div>
    <template #footer>
      <div class="footer">
        Последнее обновление: 30 сентября 2025 г.
      </div>
    </template>
  </Dialog>
</template>

<style scoped lang="scss">
.header {
  display: flex;
  flex-direction: column;
  gap: .6rem;
  order: 2;
  margin-right: auto;
  padding-left: 1.6rem;
}
h3 {
  margin: 1.4rem 0;
  line-height: 1.3 !important;
}
p, li, .footer {
  color: var(--p-zinc-400);
  font: var(--font-16-l);
  margin-bottom: .8rem;
  line-height: 1.3 !important;
}

ul {
  padding-left: 2.4rem;
  line-height: 1.3 !important;
}
.footer {
  padding: 1.4rem 1rem;
  text-align: center;
  justify-content: center;
  width: 100%;
}
</style>
